Repository: moocitfrance/xblock-free-text-response-upgrade
Catalog: freetextresponse/translations/*/LC_MESSAGES/django.po
Languages: ru

source: Display Correctness?
ru: Показать результат проверки?

source: This is a flag that indicates if the indicator icon should be displayed after a student enters their response
ru: Будет ли показываться иконка-индикатор после ввода ответа

source: Display Other Student Responses
ru: Показать ответы других

source: This will display other student responses to the student after they submit their response.
ru: Показать ответы других студентов после отправки ответа

source: Display Name
ru: Отображаемое название

source: This is the title for this question type
ru: Название для этого вопроса

source: Full-Credit Key Phrases
ru: Фразы для полного зачета

source: This is a list of words or phrases, one of which must be present in order for the student's answer to receive full credit
ru: Список слов и фраз (в кавычках), одна из которых должна быть в ответе, чтобы получить максимальный балл

source: Half-Credit Key Phrases
ru: Фразы для 50%-ного зачета

source: This is a list of words or phrases, one of which must be present in order for the student's answer to receive half credit
ru: Список слов и фраз (в кавычках), одна из которых должна быть в ответе, чтобы получить половину баллов

source: Maximum Number of Attempts
ru: Максимальное количество попыток

source: This is the maximum number of times a student is allowed to attempt the problem
ru: Максимальное количество разрешенных студенту попыток

source: Maximum Word Count
ru: Максимальное число слов

source: This is the maximum number of words allowed for this question
ru: Максимально разрешенное количество слов в ответе

source: Minimum Word Count
ru: Минимальное число слов

source: This is the minimum number of words required for this question
ru: Минимально разрешенное количество слов в ответе

source: Prompt
ru: Приглашение ввести ответ

source: This is the prompt students will see when asked to enter their response
ru: Будет показано студенту в поле ввода ответа

source: Submission Received Message
ru: Подтверждение отправки ответа

source: This is the message students will see upon submitting their response
ru: Сообщение будет показано студенту после отправки ответа

source: Weight
ru: Вес

source: This assigns an integer value representing the weight of this problem
ru: Целое значение, балл за работу

source: Draft Received Message
ru: Сообщение после сохранения черновика

source: This is the message students will see upon submitting a draft response
ru: Студенты получат его, когда сохранят ответ, но еще не отправят его

source: Allow my response to possibly be visible by other learners after submitting their response
ru: Показать мой ответ другим студентам после их оценивания

source: Checking...
ru: Проверка...

source: Submit
ru: Отправить

source: Save
ru: Сохранить черновик

source: Hide
ru: Скрыть

source: Show
ru: Показать

source: peer responses
ru: ответы коллег

source: Submissions by others
ru: Ответы других

source: No responses to show at this time
ru: На данный момент никто не ответил

source: {weight} point possible
ru: {weight} очко доступно

source: {score_string}/{weight} point
ru: {score_string}/{weight} очко

source: You have used {count_attempts} of {max_attempts} submission
ru: Использовано {count_attempts} из {max_attempts} попытки

source: Your response must be between {min} and {max} word.
ru: Ответ должен содержать от {min} до {max} слова.

source: Invalid Word Count. {word_count_message}
ru: Неверное число слов. {word_count_message}
