Repository: moocitfrance/xblock-free-text-response-upgrade
Catalog: freetextresponse/translations/*/LC_MESSAGES/text.po
Languages: fr

source: Display Correctness?
fr: Afficher la correction ?

source: This is a flag that indicates if the indicator icon should be displayed after a student enters their response
fr: Afficher l'icône d'indcateur après qu'un élève ait entré sa réponse

source: Display Other Student Responses
fr: Afficher les réponses des autres apprenants

source: This will display other student responses to the student after they submit their response.
fr: Affiche les réponses des autres apprenants après que l'apprenant a soumis sa réponse.

source: System selected answers to give to students
fr: Réponses sélectionnées par le système à donner aux étudiants

source: Display Name
fr: Nom d'affichage

source: This is the title for this question type
fr: Ceci est le titre pour ce composant

source: Full-Credit Key Phrases
fr: Message de réponse correcte

source: This is a list of words or phrases, one of which must be present in order for the student's answer to receive full credit
fr: Ceci est une liste de mots ou d'expressions, dont l'un doit être présent pour que la réponse de l'apprenent soit une réponse correcte.

source: Half-Credit Key Phrases
fr: Message de réponse semi-correcte

source: This is a list of words or phrases, one of which must be present in order for the student's answer to receive half credit
fr: Ceci est une liste de mots ou d'expressions, dont l'un doit être présent pour que la réponse de l'apprenant soit une réponse semi-correcte .

source: Maximum Number of Attempts
fr: Nombre d'essai maximum

source: This is the maximum number of times a student is allowed to attempt the problem
fr: Le nombre maximum de fois qu'un apprenant peut tenter de répondre à la question

source: Maximum Word Count
fr: Nombre de mots maximum

source: This is the maximum number of words allowed for this question
fr: Le nombre maximum de mots pour cette question

source: Minimum Word Count
fr: Nombre de mots minimum

source: This is the minimum number of words required for this question
fr: Le nombre minimum de mots pour cette question

source: Prompt
fr: Question

source: This is the prompt students will see when asked to enter their response
fr: La question à afficher aux apprenants.

source: Submission Received Message
fr: Message de confirmation de réponse reçue

source: This is the message students will see upon submitting their response
fr: Le message que les apprenant verront en soumettant leur réponse

source: Weight
fr: Poids

source: This assigns an integer value representing the weight of this problem
fr: Le nombre de points pour cette question

source: Draft Received Message
fr: Message de confirmation de brouillon reçu

source: This is the message students will see upon submitting a draft response
fr: Le message que les apprenant verront en soumettant une réponse en brouillon

source: Allow my response to possibly be visible by other learners after submitting their response
fr: Permettre à ma réponse d'être visible des autres apprenants après avoir soumis leur réponse

source: Checking...
fr: Vérification en cours...

source: Submit
fr: Soumettre

source: Save
fr: Enregistrer

source: Hide
fr: Masquer

source: Show
fr: Afficher

source: peer responses
fr: réponses des pairs

source: Submissions by others
fr: Réponses des autres apprenants

source: No responses to show at this time
fr: Aucune réponse à afficher pour le moment

source: You have used {count_attempts} of {max_attempts} submission
fr: Vous avez utilisé {count_attempts} de {max_attempts} essai.

source: Your response must be between {min} and {max} word.
fr: Votre réponse doit comporter entre {min} et {max} mots.

source: Invalid Word Count. {word_count_message}
fr: Nombre de mots invalide. {word_count_message}
